# 1.2.pandas

## A) Creating Dataframes

In [ ]:
import pandas as pd
#from a dictionary
data={
    'name':['alice','bob','charlie'],
    'age':[25,30,35],
    'city':['new york','san francisco','los angeles']
}
df=pd.DataFrame(data)
print(df)
#viewing data
print(df.head())
print(df.info())
print(df.describe())

      name  age           city
0    alice   25       new york
1      bob   30  san francisco
2  charlie   35    los angeles
      name  age           city
0    alice   25       new york
1      bob   30  san francisco
2  charlie   35    los angeles
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None
        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

B) Selection And Filtering

In [ ]:
#selection and filtering
ages=df['age']
#Filtering rows
above_25=df[df['age']>25]
#iloc(integer_based) vs loc(label_based)
row_0=df.iloc[0]#first row(Alice's data)
specific_val=df.loc[0,'city']#'new york'
print(above_25)

      name  age           city
1      bob   30  san francisco
2  charlie   35    los angeles

C)Data cleaning(Handling missing values)

In [ ]:
#checking for nulls
print(df.isnull().sum())
#dropping missing values
df_cleaned=df.dropna()
#filling missing values
df_filled=df.fillna(0)#fill NaNs with 0
#or fill with mean
df['age']=df['age'].fillna(df['age'].mean())
print(df['age'])

name    0
age     0
city    0
dtype: int64
0    25
1    30
2    35
Name: age, dtype: int64

# Student management system scenario based questions



```
Codes after importing CSV file(dataset for pandas(11249a381) - sheet1.csv
```

In [ ]:
import pandas as pd
df=pd.read_csv('/content/dataset for pandas(11249a381) - Sheet1.csv')
print(df)

   Roll.no     Name  Age  Marks Department Section
0        1    Alice   20   78.0        CSE       A
1        2      Bob   21    NaN        ECE       B
2        3  Charlie   19   65.0        CSE       A
3        4    David   22   45.0        EEE       C
4        5      Eva   20   88.0        CSE       B
5        6      Bob   21   55.0        ECE       B

In [ ]:
import pandas as pd
df=pd.read_csv('/content/dataset for pandas(11249a381) - Sheet1.csv')
print(df)

   Roll.no     Name  Age  Marks Department Section
0        1    Alice   20   78.0        CSE       A
1        2      Bob   21    NaN        ECE       B
2        3  Charlie   19   65.0        CSE       A
3        4    David   22   45.0        EEE       C
4        5      Eva   20   88.0        CSE       B
5        6      Bob   21   55.0        ECE       B

In [ ]:
import pandas as pd
df=pd.read_csv('/content/dataset for pandas(11249a381) - Sheet1.csv')
print(df)

   Roll.no     Name  Age  Marks Department Section
0        1    Alice   20   78.0        CSE       A
1        2      Bob   21    NaN        ECE       B
2        3  Charlie   19   65.0        CSE       A
3        4    David   22   45.0        EEE       C
4        5      Eva   20   88.0        CSE       B
5        6      Bob   21   55.0        ECE       B

In [ ]:
import pandas as pd
df=pd.read_csv('/content/dataset for pandas(11249a381) - Sheet1.csv')
print(df)

   Roll.no     Name  Age  Marks Department Section
0        1    Alice   20   78.0        CSE       A
1        2      Bob   21    NaN        ECE       B
2        3  Charlie   19   65.0        CSE       A
3        4    David   22   45.0        EEE       C
4        5      Eva   20   88.0        CSE       B
5        6      Bob   21   55.0        ECE       B

In [ ]:
#2 display only name and marks
print(df[['Name','Marks']])

      Name  Marks
0    Alice   78.0
1      Bob    NaN
2  Charlie   65.0
3    David   45.0
4      Eva   88.0
5      Bob   55.0

In [ ]:
#3 some students have missing values in the marks column.replace with 0
df['Marks']=df['Marks'].fillna(0)
print(df)

   Roll.no     Name  Age  Marks Department Section
0        1    Alice   20   78.0        CSE       A
1        2      Bob   21    0.0        ECE       B
2        3  Charlie   19   65.0        CSE       A
3        4    David   22   45.0        EEE       C
4        5      Eva   20   88.0        CSE       B
5        6      Bob   21   55.0        ECE       B

In [ ]:
#4 from a student dataset,select students whose marks>60
above_60=df[df['Marks']>60]
print(above_60)

   Roll.no     Name  Age  Marks Department Section
0        1    Alice   20   78.0        CSE       A
2        3  Charlie   19   65.0        CSE       A
4        5      Eva   20   88.0        CSE       B

In [ ]:
#5 sort the students based on marks in descending order
sorted_df=df.sort_values(by='Marks',ascending=False)
print(sorted_df)

   Roll.no     Name  Age  Marks Department Section
4        5      Eva   20   88.0        CSE       B
0        1    Alice   20   78.0        CSE       A
2        3  Charlie   19   65.0        CSE       A
5        6      Bob   21   55.0        ECE       B
3        4    David   22   45.0        EEE       C
1        2      Bob   21    0.0        ECE       B

In [ ]:
#6 add a new column result that shows "pass" if marks>=50,else"fail"
df['Result']=df['Marks'].apply(lambda x:'pass' if x>=50 else 'fail')
print(df)

   Roll.no     Name  Age  Marks Department Section Result
0        1    Alice   20   78.0        CSE       A   pass
1        2      Bob   21    0.0        ECE       B   fail
2        3  Charlie   19   65.0        CSE       A   pass
3        4    David   22   45.0        EEE       C   fail
4        5      Eva   20   88.0        CSE       B   pass
5        6      Bob   21   55.0        ECE       B   pass

In [ ]:
#7 count the total number of students in the dataset
total_students=len(df)
print("total_students:",total_students)

total_students: 6

In [ ]:
#8 find the average marks of all students
average_marks=df['Marks'].mean()
print("average_marks:",average_marks)

average_marks: 55.166666666666664

In [ ]:
#9 remove duplicate student records from the dataset
df=df.drop_duplicates()
print(df)

   Roll.no     Name  Age  Marks Department Section Result
0        1    Alice   20   78.0        CSE       A   pass
1        2      Bob   21    0.0        ECE       B   fail
2        3  Charlie   19   65.0        CSE       A   pass
3        4    David   22   45.0        EEE       C   fail
4        5      Eva   20   88.0        CSE       B   pass
5        6      Bob   21   55.0        ECE       B   pass